[
  {
    "id": "react",
    "title": "React",
    "description": "مكتبة JavaScript لبناء واجهات المستخدم، خاصة تطبيقات الويب.",
    "content": "React هي مكتبة JavaScript مجانية ومفتوحة المصدر لبناء واجهات المستخدم مبنية على المكونات. طورتها شركة فيسبوك، وأصبحت React واحدة من أكثر المكتبات شعبية في تطوير الويب.\n\nتشمل المفاهيم الرئيسية المكونات، وJSX، والـ DOM الافتراضي، وإدارة الحالة، والـ hooks. تتبع React نموذج البرمجة الإعلاني وتستخدم بنية مبنية على المكونات.\n\nتشمل بيئة React الأدوات مثل Create React App، وNext.js، وGatsby، ومكتبات إدارة الحالة مثل Redux وZustand. وتُستخدم على نطاق واسع لبناء تطبيقات الصفحة الواحدة والتطبيقات الويب التقدمية.",
    "category": "إطار العمل الأمامي",
    "type": "مكتبة",
    "maintainer": "ميتا (فيسبوك)",
    "firstRelease": "2013",
    "license": "MIT"
  },
  {
    "id": "nextjs",
    "title": "Next.js",
    "description": "إطار عمل React يمكّن الوظائف مثل تقديم الخادم وإنشاء الموقع الثابت.",
    "content": "Next.js هو إطار عمل React يوفر البنية التحتية وتجربة تطوير بسيطة للتطبيقات المقدمة من الخادم. يقدم ميزات مثل تقسيم الكود التلقائي، والأداء المحسّن، ودعم CSS المدمج.\n\nتشمل الميزات الرئيسية تقديم الخادم (SSR)، وإنشاء الموقع الثابت (SSG)، ومسارات واجهة برمجة التطبيقات، وتقسيم الكود التلقائي، والتحسين المدمج. يوفر موجه التطبيق في Next.js 13+ توجيهاً وتصميمات محسّنة.\n\nNext.js مثالي لبناء تطبيقات React جاهزة للإنتاج بأداء ممتاز وتحسين محركات البحث. وتُستخدم من قبل شركات مثل Netflix وUber وStarbucks لتطبيقاتها على الويب.",
    "category": "إطار العمل الكامل المكدس",
    "type": "إطار عمل",
    "maintainer": "Vercel",
    "firstRelease": "2016",
    "license": "MIT"
  },
  {
    "id": "tailwindcss",
    "title": "Tailwind CSS",
    "description": "إطار عمل CSS يعتمد على الأدوات لبناء واجهات مستخدم مخصصة بسرعة.",
    "content": "Tailwind CSS هو إطار عمل CSS يعتمد على الأدوات التي توفر فئات أدوات منخفضة المستوى لبناء تصاميم مخصصة دون مغادرة HTML الخاص بك. فهو يروّج لنمط مختلف في CSS باستخدام أدوات صغيرة وقابلة للتركيب.\n\nتشمل الفوائد الرئيسية التطوير السريع، وأنظمة التصميم المتسقة، وأدوات التصميم المستجيب، وخيارات التخصيص. يتضمن Tailwind إزالة مدمجة لـ CSS غير المستخدم في الإنتاج.\n\nاكتسب Tailwind CSS شعبية بسبب تجربة المطور الخاصة به ويُستخدم على نطاق واسع في تطوير الويب الحديث، خاصة مع React وVue وأطر العمل الأخرى المبنية على المكونات.",
    "category": "إطار عمل CSS",
    "type": "إطار عمل",
    "maintainer": "Tailwind Labs",
    "firstRelease": "2017",
    "license": "MIT"
  }
]