[
  {
    "id": "javascript",
    "title": "JavaScript",
    "description": "لغة برمجة متعددة الاستخدامات لتطوير الويب، وتطبيقات الخادم، والمزيد.",
    "content": "JavaScript هي لغة برمجة عالية المستوى ومُفسرة أصبحت واحدة من أكثر اللغات شعبية في العالم. صُممت في الأصل لمتصفحات الويب، وتوسعت JavaScript لتشمل تطوير الخادم، والتطبيقات المحمولة، والبرامج المكتبية.\n\nتشمل الميزات الرئيسية الكتابة الديناميكية، والدوال من الدرجة الأولى، والتوجيه نحو الكائنات القائم على النموذج، والبرمجة المعتمدة على الأحداث. يتضمن JavaScript الحديث (ES6+) ميزات مثل الدوال السهمية، والفئات، والوحدات، وasync/await.\n\nJavaScript ضرورية لتطوير الواجهة الأمامية وتدعم أطر العمل مثل React وVue وAngular. في جانب الخادم، يمكّن Node.js JavaScript من تطوير الواجهة الخلفية.",
    "category": "تطوير الويب",
    "difficulty": "مبتدئ إلى متقدم",
    "popularity": "عالية جداً",
    "firstAppeared": "1995",
    "paradigms": ["متعدد النماذج", "معتمد على الأحداث", "وظيفي", "موجه نحو الكائنات"]
  },
  {
    "id": "python",
    "title": "Python",
    "description": "لغة برمجة قوية وسهلة التعلم مع مكتبات وتطبيقات واسعة.",
    "content": "Python هي لغة برمجة عالية المستوى ومُفسرة تُعرف ببساطتها وسهولة قراءتها. تؤكد على قابلية قراءة الكود مع استخدامها الملحوظ للمسافات البيضاء المهمة وبناء جملة واضح.\n\nتدعم Python نماذج البرمجة المتعددة بما في ذلك البرمجة الإجرائية، والموجهة نحو الكائنات، والوظيفية. ولها مكتبة قياسية شاملة وبيئة ضخمة من الحزم من طرف ثالث.\n\nتشمل التطبيقات الشائعة تطوير الويب (Django، Flask)، وعلوم البيانات (NumPy، Pandas)، وتعلم الآلة (TensorFlow، PyTorch)، والأتمتة، والحوسبة العلمية.",
    "category": "لغة عامة الغرض",
    "difficulty": "مبتدئ",
    "popularity": "عالية جداً",
    "firstAppeared": "1991",
    "paradigms": ["متعدد النماذج", "موجه نحو الكائنات", "إجرائي", "وظيفي"]
  },
  {
    "id": "typescript",
    "title": "TypeScript",
    "description": "مجموعة فرعية مُطبقة من JavaScript تُجمع إلى JavaScript عادي، مضيفة تعريفات الأنواع الثابتة.",
    "content": "TypeScript هي لغة برمجة طورتها Microsoft وتُبنى على JavaScript بإضافة تعريفات الأنواع الثابتة. تساعد في اكتشاف الأخطاء مبكرًا من خلال نظام الأنواع وتجعل تطوير JavaScript أكثر كفاءة.\n\nيتم تحويل كود TypeScript إلى JavaScript، مما يجعله متوافقًا مع أي متصفح أو مضيف أو نظام تشغيل. يدعم ميزات JavaScript الحديثة ويضيف إمكانيات قوية لفحص الأنواع.\n\nتُعتمد على نطاق واسع في التطبيقات كبيرة الحجم، حيث يحسن TypeScript من جودة الكود وإنتاجية المطور وسهولة الصيانة. إنه شائع بشكل خاص في تطوير React وAngular وNode.js.",
    "category": "تطوير الويب",
    "difficulty": "متوسط",
    "popularity": "عالية",
    "firstAppeared": "2012",
    "paradigms": ["متعدد النماذج", "موجه نحو الكائنات", "وظيفي"]
  }
]