[
  {
    "id": "nextjs-14-features",
    "title": "Next.js 14: الميزات الجديدة والتحسينات",
    "excerpt": "اكتشف أحدث الميزات في Next.js 14 بما في ذلك الأداء المحسّن وتجربة المطور.",
    "content": "يجلب Next.js 14 تحسينات كبيرة على إطار عمل React، بما في ذلك تحسينات الأداء وتجربة المطور المحسّنة والميزات الجديدة التي تجعل بناء تطبيقات الويب الحديثة أكثر كفاءة. في هذا الدليل الشامل، سنستكشف جميع الميزات الجديدة وكيف يمكن أن تستفيد مشاريعك منها.\n\nتشمل التحسينات الأكثر أهمية أوقات بناء أسرع، ووظيفة إعادة التحميل السريع المحسّنة، وقدرات تقديم الخادم المحسّنة. تم تحسين موجه التطبيق الجديد بشكل أكبر، مما يسهل إنشاء هياكل توجيه معقدة مع الحفاظ على أداء ممتاز.\n\nبالإضافة إلى ذلك، يقدم Next.js 14 دعمًا أفضل لـ TypeScript، ومعالجة أخطاء محسّنة، وأدوات تصحيح أخطاء محسّنة تجعل التطوير أكثر إنتاجية ومتعة.",
    "image": "/placeholder.svg?height=400&width=600",
    "author": "سارة جونسون",
    "publishedAt": "2024-01-15",
    "readTime": "8 دقائق قراءة",
    "tags": ["Next.js", "React", "تطوير الويب", "JavaScript"]
  },
  {
    "id": "react-server-components",
    "title": "فهم مكونات خادم React",
    "excerpt": "غوص عميق في مكونات خادم React وكيفية تغييرها لطريقة بناء تطبيقات React.",
    "content": "تمثل مكونات خادم React تحولاً في كيفية تفكيرنا في تطبيقات React. من خلال السماح للمكونات بالتشغيل على الخادم، يمكننا تحقيق أداء أفضل، وحجم حزمة أصغر، وتجارب مستخدم محسّنة.\n\nتستكشف هذه المقالة المفاهيم الأساسية وراء المكونات الخادمية، وفوائدها، واستراتيجيات التنفيذ العملية. سنغطي كيفية اختلافها عن المكونات العميلية التقليدية، ومتى تستخدم كل نوع، وأفضل الممارسات لبناء تطبيقات هجينة.\n\nسنفحص أيضًا أمثلة من العالم الحقيقي ومقاييس الأداء التي تُظهر التحسينات الكبيرة التي يمكن أن تجلبها مكونات الخادم لتطبيقاتك.",
    "image": "/placeholder.svg?height=400&width=600",
    "author": "مايك تشين",
    "publishedAt": "2024-01-12",
    "readTime": "12 دقيقة قراءة",
    "tags": ["React", "مكونات الخادم", "الأداء", "البنية"]
  },
  {
    "id": "tailwind-css-best-practices",
    "title": "أفضل ممارسات Tailwind CSS للمشاريع الكبيرة",
    "excerpt": "تعلم كيفية استخدام Tailwind CSS بفعالية في المشاريع واسعة النطاق مع التنظيم المناسب والتحسين.",
    "content": "لقد ثَوّرت Tailwind CSS الطريقة التي نتعامل بها مع التصميم في تطوير الويب الحديث. ومع ذلك، يتطلب إدارة Tailwind في المشاريع الكبيرة تخطيطًا وتنظيمًا دقيقًا للحفاظ على جودة الكود وإنتاجية المطور.\n\nيغطي هذا الدليل الشامل أفضل الممارسات لتنظيم فئات Tailwind، وإنشاء مكونات قابلة لإعادة الاستخدام، والتحسين للإنتاج، والحفاظ على الاتساق عبر الفرق الكبيرة. سنستكشف تقنيات متقدمة مثل الأدوات المخصصة، واستخراج المكونات، وتكامل نظام التصميم.\n\nستتعلم كيفية هيكلة تكوين Tailwind الخاص بك، وتنفيذ اصطلاحات تسمية فعالة، والاستفادة من الأدوات التي تجعل العمل مع Tailwind في نطاق واسع أكثر قابلية للإدارة.",
    "image": "/placeholder.svg?height=400&width=600",
    "author": "إميلي رودريغيز",
    "publishedAt": "2024-01-10",
    "readTime": "10 دقائق قراءة",
    "tags": ["Tailwind CSS", "CSS", "أفضل الممارسات", "قابلية التوسع"]
  }
]