[
  {
    "id": "furniture-moving",
    "title": "خدمات نقل العفش",
    "description": "خدمات نقل العفش المتخصصة في جميع أنحاء المملكة العربية السعودية.",
    "fullDescription": "نوفر خدمات نقل العفش الاحترافية بأعلى معايير الجودة والسلامة في جميع أنحاء المملكة العربية السعودية. فريقنا المدرب يستخدم أفضل المعدات والتقنيات لضمان نقل آمن وسليم لجميع ممتلكاتكم دون أي خدش أو تلف. نقدم خدمات التغليف المتخصصة، والتحميل والتنزيل الآمن، والتخزين المؤقت عند الحاجة، وتركيب الأثاث في المكان الجديد. خدمة متوفرة على مدار 24 ساعة في جميع أيام الأسبوع.",
    "image": "/placeholder.svg?height=300&width=400",
    "features": ["تغليف احترافي", "تحميل وتنزيل آمن", "تتبع الشحنات", "تركيب الأثاث"],
    "duration": "حسب المسافة والكمية",
    "availability": "متوفر على مدار 24 ساعة"
  },
  {
    "id": "cleaning-services",
    "title": "خدمات النظافة",
    "description": "خدمات النظافة الشاملة للمستشفيات والشركات والمنازل في جميع أنحاء المملكة.",
    "fullDescription": "نوفر خدمات النظافة الاحترافية للمستشفيات والشركات والمنازل في جميع أنحاء المملكة العربية السعودية. فريقنا المدرب يستخدم أفضل المواد والتقنيات لضمان نظافة مثالية وتعقيم شامل. نقدم خدمات النظافة العادية والعميقة، وتعقيم الأسطح، وتنظيف السجاد والموكيت، وصيانة المسابح، وخدمات التعقيم المضادة للبكتيريا والفيروسات. خدمة متوفرة في جميع أيام الأسبوع مع مواعيد مرنة.",
    "image": "/placeholder.svg?height=300&width=400",
    "features": ["نظافة عميقة", "تعقيم شامل", "مواد صديقة للبيئة", "عمالة مدربة"],
    "duration": "حسب المساحة والخدمات المطلوبة",
    "availability": "متوفر طوال الأسبوع"
  },
  {
    "id": "security-systems",
    "title": "الكاميرات وأنظمة الأمان",
    "description": "أنظمة الأمان والمراقبة المتكاملة في جميع أنحاء المملكة العربية السعودية.",
    "fullDescription": "نوفر حلول الأمان والمراقبة المتكاملة في جميع أنحاء المملكة العربية السعودية. نقدم تركيب وصيانة أنظمة المراقبة بكاميرات عالية الدقة، وأنظمة إنذار الحريق، وأنظمة التحكم في الوصول، وأنظمة الكشف عن المعادن. فريقنا المختص يضمن أعلى معايير الأمان لحماية ممتلكاتكم وأسرتكم مع دعم فني على مدار الساعة. خدمة الصيانة الدورية متوفرة حسب الطلب.",
    "image": "/placeholder.svg?height=300&width=400",
    "features": ["تركيب كاميرات مراقبة", "أنظمة إنذار الحريق", "تحكم في الوصول", "دعم فني 24/7"],
    "duration": "حسب النظام المطلوب",
    "support": "دعم فني على مدار الساعة"
  },
  {
    "id": "ac-services",
    "title": "المكيفات: تركيب، صيانة، وتوريد",
    "description": "خدمات تركيب وصيانة وتوريد أنظمة التبريد في جميع أنحاء المملكة.",
    "fullDescription": "نوفر خدمات تركيب وصيانة وتوريد أنظمة التبريد والتهوية في جميع أنحاء المملكة العربية السعودية. نقدم خدمات الصيانة الدورية، وإصلاح الأعطال، وتركيب وحدات تكييف حديثة من أفضل الماركات العالمية. فريقنا المختص يتعامل مع جميع أنواع أنظمة التكييف السكني والتجاري والصناعي مع ضمانات شاملة وخدمة ما بعد البيع. خدمة الطوارئ متوفرة على مدار 24 ساعة.",
    "image": "/placeholder.svg?height=300&width=400",
    "features": ["تركيب مكيفات", "صيانة دورية", "توريد مكيفات", "إصلاح الأعطال"],
    "duration": "حسب نوع الخدمة",
    "emergency": "خدمة الطوارئ 24 ساعة"
  }
]